In [1]:
# Pandas.

In [2]:
import numpy as np
import pandas as pd

In [3]:
# Series basicamente dicionarios
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data=minha_lista, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
series = pd.Series(data=minha_lista, index=labels)
series['b']

20

In [6]:
pd.Series(minha_lista, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
serie1 = pd.Series([1, 2, 3, 4], ['EUA', 'Alemanha', 'URSS', 'Japão'])
serie1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [8]:
serie2 = pd.Series([1, 2, 3, 4], ['EUA', 'Alemanha', 'Italia', 'Japão'])
serie2

EUA         1
Alemanha    2
Italia      3
Japão       4
dtype: int64

In [9]:
serie1 + serie2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
URSS        NaN
dtype: float64

In [10]:
# Criação e fatiamento

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split()) # os indicies são as linhas
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
type(df['W'])

pandas.core.series.Series

In [15]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [18]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [20]:
df.drop('new', axis=1, inplace=True) # o Inplace altera diretamente o dataframe
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.loc['A', 'W'] # primeiro indice é a linhas depois a coluna

2.706849839399938

In [22]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [23]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']] # primeiro indices é a linhas depois as colunas

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [24]:
df.iloc[1:4, 2:] 
# Nas linhas eu começo do incide 1 até o indice 3 o indice 4 é excluido, nas colunas do 2 para frente.
# o primeiro indico é incluiso o segundo é excluido


#   W	        X	        Y 	        Z
# A 2.706850	0.628133	0.907969	0.503826
# B 0.651118	-0.319318	-0.848077	0.605965
# C -2.018168	0.740122	0.528813	-0.589001
# D 0.188695	-0.758872	-0.933237	0.955057
# E 0.190794	1.978757	2.605967	0.683509

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [25]:
# loc seleção baseado no nome dos indices das colunas
# iloc selecão baseado no metodo do numpy
# diferença básica entre loc e iloc é que o loc usa rótulos para acessar os elementos, enquanto o iloc usa índices numéricos.

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
maior_zero = df > 0
df[maior_zero]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df['W'] > 0] # desta forma somente os valores maiores que zero na coluna W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df[df['W'] > 0]['Y'] # retorna somente a coluna 'Y' ondes os valores são maiores que zero.

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [30]:
# o codigo acima é segue a mesma logica do de baixo.
maior_zero = df > 0
df2 = df[maior_zero]
df2['Y']

A    0.907969
B         NaN
C    0.528813
D         NaN
E    2.605967
Name: Y, dtype: float64

In [31]:
df[(df['W']>0) & (df['Y']>1)] # utilizar o & e não o and

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df[(df['W']>0) | (df['Y']>1)] # utilizar o | e não o or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [34]:
col = 'RS Rj SP AM SC'.split()
col

['RS', 'Rj', 'SP', 'AM', 'SC']

In [35]:
df['Estados'] = col
df

          W         X         Y         Z Estados
A  2.706850  0.628133  0.907969  0.503826      RS
B  0.651118 -0.319318 -0.848077  0.605965      Rj
C -2.018168  0.740122  0.528813 -0.589001      SP
D  0.188695 -0.758872 -0.933237  0.955057      AM
E  0.190794  1.978757  2.605967  0.683509      SC

In [36]:
df.set_index('Estados')

                W         X         Y         Z
Estados
RS       2.706850  0.628133  0.907969  0.503826
Rj       0.651118 -0.319318 -0.848077  0.605965
SP      -2.018168  0.740122  0.528813 -0.589001
AM       0.188695 -0.758872 -0.933237  0.955057
SC       0.190794  1.978757  2.605967  0.683509

In [37]:
# indices e multiniveis
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [38]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [39]:
inside

[1, 2, 3, 1, 2, 3]

In [40]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [41]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [42]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [43]:
df.index.names = ['Grupo', 'Numero']
df

                     A         B
Grupo Numero
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

In [44]:
df.xs('G1')

               A         B
Numero
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [45]:
df.xs(1, level='Numero')

              A         B
Grupo
G1     0.302665  1.693723
G2     0.166905  0.184502

In [46]:
# dados ausentes
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [47]:
df = pd.DataFrame(data=d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
df.dropna() # excluo os valores nan, porem exclui as linhas que possui esses valores

     A    B  C
0  1.0  5.0  1

In [49]:
df.dropna(thresh=2) # excluu os valores nan, e  exclui as linhas que possui 2 valoes NAN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [50]:
df.fillna('preenchido') # substitui os valores NAN

            A           B  C
0         1.0         5.0  1
1         2.0  preenchido  2
2  preenchido  preenchido  3

In [51]:
df['A'].fillna(value=df['A'].mean()) # substitui os valores NAN, pelos médias dos valores

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [52]:
df.fillna(method='ffill') # preencha os valores NAN com os valores anteriores.

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [53]:
# GROUP BY

In [54]:
# criar um dataframe
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [55]:
group = df.groupby('Empresa')
group

In [56]:
group.sum(numeric_only=True) # soma os valores de vendas das empresa

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [57]:
group.mean(numeric_only=True) # encontra média de vendas dos valores das empresa

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [59]:
groupName = df.groupby('Nome')
groupName.sum(numeric_only=True)

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [60]:
#  mesclar, juntar e concatenas
import pandas as pd
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3]);

df2 = pd.DataFrame({'A': ['A5', 'A5', 'A6', 'A7'],
                    'B': ['A4', 'B5', 'B6', 'B7'],
                    'C': ['A4', 'C5', 'C6', 'C7'],
                    'D': ['A4', 'D5', 'D6', 'D7']},
                     index=[4, 5, 6, 7]);


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                     index=[8, 9, 10, 11]);

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [61]:
df2

    A   B   C   D
4  A5  A4  A4  A4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [62]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
#concatenação 
pd.concat([df1, df2, df3], axis=0) 
# axis igual a 0 faz a concatenação pelas colunas 
# axis igual a 1 faz a concatenacao pelas linhas
# por padrão o axis é igual a 0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A5   A4   A4   A4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [64]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A5   A4   A4   A4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [65]:
# outros dataframes
esquerda  = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})


direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [66]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [67]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [68]:
# mesclar os dataframe
pd.merge(esquerda, direita, how='inner', on='key') 
# A função mesclar permite que voce mescle os quadros de dados juntos usando a mesma logica que o SQL

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [84]:
# operações em pandas
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [70]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [71]:
len(df['col2'].unique())

3

In [72]:
df['col2'].nunique()

3

In [73]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [74]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [75]:
def vezes2(x):
    return x*2

In [76]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [77]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [78]:
df['col3'].apply(lambda x: x * 2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [79]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [80]:
del df['col2'] # deletando a coluna 2
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [86]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [85]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [87]:
df.sort_values(by='col2') # ordenação pela coluna COL2, inplace padrão false

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
df.isnull() # retornar os nullos

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [91]:
df.dropna # apaga os valores nan

<bound method DataFrame.dropna of    col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz>

In [99]:
df = pd.DataFrame({'col1': [1,2,3, np.nan],
                   'col2': [np.nan, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']
                  })
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [103]:
df['col1'] = df['col1'].fillna(value=df['col1'].mean()) # preeche a coluna col1 onde nan vai ser preenchido com a média dos valores
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [106]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [107]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [108]:
# ENTRADAS E SAIDA DE DADOS
import numpy as np
import pandas as pd

In [110]:
df = pd.read_csv('exemplo')
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [112]:
df = df + 1
df

    a   b   c   d
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17

In [113]:
df.to_csv('exemplo.csv', sep=';', decimal=',')

In [114]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                  First Republic Bank      San Francisco      CA     59017
 1                       Signature Bank           New York      NY     57053
 2                  Silicon Valley Bank        Santa Clara      CA     24735
 3                    Almena State Bank             Almena      KS     15426
 4           First City Bank of Florida  Fort Walton Beach      FL     16748
 ..                                 ...                ...     ...       ...
 561                 Superior Bank, FSB           Hinsdale      IL     32646
 562                Malta National Bank              Malta      OH      6629
 563    First Alliance Bank & Trust Co.         Manchester      NH     34264
 564  National State Bank of Metropolis         Metropolis      IL      3815
 565                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 1                    Flagstar Bank, N.A.      March 12, 2023     10540
 2    First–Citizens Bank & Trust Company      March 10, 2023     10539
 3                            Equity Bank    October 23, 2020     10538
 4              United Fidelity Bank, fsb    October 16, 2020     10537
 ..                                   ...                 ...       ...
 561                Superior Federal, FSB       July 27, 2001      6004
 562                    North Valley Bank         May 3, 2001      4648
 563  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 564              Banterra Bank of Marion   December 14, 2000      4646
 565                   Bank of the Orient    October 13, 2000      4645

 [566 rows x 7 columns]]

In [115]:
type(df)

list

In [116]:
len(df)

1

In [117]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
...,...,...,...,...,...,...,...
561,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
562,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
563,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
564,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
565,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [118]:
df[0]['Bank NameBank']

0                    First Republic Bank
1                         Signature Bank
2                    Silicon Valley Bank
3                      Almena State Bank
4             First City Bank of Florida
                     ...
561                   Superior Bank, FSB
562                  Malta National Bank
563      First Alliance Bank & Trust Co.
564    National State Bank of Metropolis
565                     Bank of Honolulu
Name: Bank NameBank, Length: 566, dtype: object